docs/2009-06-1512126.md

# SSAS : 如何在http访问SSAS中指定语言标识 
> 原文发表于 2009-06-27, 地址: http://www.cnblogs.com/chenxizhang/archive/2009/06/27/1512126.html 


我们之前提到，如果在ADOMD.NET里面的话，它的ConnectionString有一个属性叫LocaleIdentifier，这是指定语言的。

 那么如果我们是通过HTTP的方式来访问SSAS的话，该怎麽办呢

 其实道理也是差不多的，可以通过在消息包中指定下面的信息即可

 <Envelope xmlns="<http://schemas.xmlsoap.org/soap/envelope/>"> <Header> <BeginSession soap:mustUnderstand="1" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="urn:schemas-microsoft-com:xml-analysis" /> <Version Sequence="2" xmlns="<http://schemas.microsoft.com/analysisservices/2003/engine/2>" /><NamespaceCompatibility xmlns="<http://schemas.microsoft.com/analysisservices/2003/xmla>" mustUnderstand="0"/></Header> <Body> <Execute xmlns="urn:schemas-microsoft-com:xml-analysis"> <Command> <Statement /> </Command> <Properties> <PropertyList> **<LocaleIdentifier>2052</LocaleIdentifier>** <DataSourceInfo /> </PropertyList> </Properties> </Execute> </Body> </Envelope>

 本文由作者：[陈希章](http://www.xizhang.com) 于 2009/6/27 10:09:25 发布在：<http://www.cnblogs.com/chenxizhang/>  
 本文版权归作者所有，可以转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。   
 更多博客文章，以及作者对于博客引用方面的完整声明以及合作方面的政策，请参考以下站点：[陈希章的博客中心](http://www.xizhang.com/blog.htm) 

































